Repository: saqibalifd/bookapp_bloc
Catalog: lib/l10n/app_*.arb
Languages: ur

source: Hello World
ur: ہیلو ورلڈ

source: Email
ur: ای میل

source: Password
ur: پاس ورڈ

source: Login
ur: لاگ ان

# aCompleteValidEmailExamplejoegmailcom
source: A complete, valid email e.g. joe@gmail.com
ur: ایک مکمل، درست ای میل مثلاً joe@gmail.com

source: Please ensure the email entered is valid
ur: براہ کرم یقینی بنائیں کہ درج کی گئی ای میل درست ہے

# passwordShouldbeatleast_characterswithatleastoneletterandnumber
source: Password should be at least 8 characters with at least one letter and number
ur: پاس ورڈ میں کم از کم 8 حروف ہونے چاہئیں، جن میں کم از کم ایک حرف اور ایک نمبر شامل ہو

# passwordRequirements
source: Password must be at least 8 characters and contain at least one letter and number
ur: پاس ورڈ میں کم از کم 8 حروف ہونے چاہئیں اور ایک حرف اور ایک نمبر شامل ہونا چاہیے

source: Submit
ur: جمع کروائیں

source: Submitting...
ur: جمع کر رہے ہیں...

source: Splash screen
ur: سپلیش اسکرین

source: Popular Shows
ur: مشہور پروگرامز

source: No Data Found
ur: کوئی ڈیٹا نہیں ملا

source: No Internet Connection
ur: انٹرنیٹ کنکشن دستیاب نہیں

source: Logout
ur: لاگ آؤٹ

# continueText
source: Continue
ur: جاری رکھیں

source: Get Started
ur: شروع کریں

source: Sign In
ur: سائن ان کریں

source: Sign Up
ur: سائن اپ کریں

source: Forgot Password
ur: پاس ورڈ بھول گئے

# discoverYourNextFavoriteRead
source: Discover your next favorite read. Sign in and dive into a world of books you’ll love.
ur: اپنی اگلی پسندیدہ کتاب دریافت کریں۔ سائن ان کریں اور کتابوں کی دنیا میں غوطہ لگائیں جنہیں آپ پسند کریں گے۔

# joinOurCommunityOfBookLovers
source: Join our community of book lovers. Create an account and start your reading journey today.
ur: کتابوں کے شوقین افراد کی ہماری کمیونٹی میں شامل ہوں۔ ایک اکاؤنٹ بنائیں اور آج ہی اپنی مطالعہ کی مہم کا آغاز کریں۔

# forgotYourPasswordResetIt
source: Forgot your password? Reset it and get back to exploring your bookshelf in seconds.
ur: اپنا پاس ورڈ بھول گئے؟ اسے دوبارہ سیٹ کریں اور چند لمحوں میں اپنی بک شیلف کا دوبارہ جائزہ لیں۔

# forgotPasswordQuestion
source: Forgot password?
ur: پاس ورڈ بھول گئے؟

source: Don’t have an account?
ur: اکاؤنٹ نہیں ہے؟

source: Already have an account?
ur: پہلے سے اکاؤنٹ موجود ہے؟

source: or
ur: یا

source: Sign in with Google
ur: گوگل کے ساتھ سائن ان کریں

source: Sign up with Google
ur: گوگل کے ساتھ سائن اپ کریں

source: Forgot
ur: بھول گئے

source: Name
ur: نام

# wellcomeBackBunny
source: Welcome back, Bunny!
ur: خوش آمدید، بنی!

source: What do you want to read?
ur: آپ کیا پڑھنا چاہتے ہیں؟

source: Search
ur: تلاش

source: About the author
ur: مصنف کے بارے میں

source: Overview
ur: جائزہ

source: Read Previews
ur: پیش نظارے پڑھیں

source: Add to favourite
ur: پسندیدہ میں شامل کریں

source: Favourite
ur: پسندیدہ

source: Place Order
ur: آرڈر کریں

source: Save
ur: محفوظ کریں

source: About
ur: کے بارے میں

source: Enter email
ur: ای میل درج کریں

source: Enter password
ur: پاس ورڈ درج کریں

source: Email is not correct
ur: ای میل درست نہیں ہے

# pleaseEnterGreateSixChar
source: please enter password greater than 6 char
ur: براہ کرم 6 حروف سے زیادہ کا پاس ورڈ درج کریں
